/* No comment provided by engineer. */
"%@ copied to clipboard" = "%@ نسخها إلى الحافظة";

/* No comment provided by engineer. */
"%d Confirmations" = "%d تأكيد";

/* No comment provided by engineer. */
"%d Transactions" = "%d المعاملات";

/* No comment provided by engineer. */
"Account Settings" = "إعدادات الحساب";

/* No comment provided by engineer. */
"Add to Address book?" = "إضافة إلى دفتر العناوين ؟ ";

/* No comment provided by engineer. */
"An error occured validating your PIN code with the remote server. You may be offline or blockchain may be experiencing difficulties. Would you like retry validation or instead enter your password manually?" = "حدث خطأ التحقق من صحة الرمز السري مع الملقم البعيد. قد تكون دون اتصال أو blockchain قد تكون تعاني من صعوبات. هل ترغب في إعادة المحاولة التحقق من صحة أو بدلا من إدخال كلمة السر الخاصة بك يدويا ؟ ";

/* No comment provided by engineer. */
"An error was encountered loading your wallet. You may be offline or Blockchain is experiencing difficulties. Please close the application and try again later or re-pair you device." = "رسالة خطأ في تحميل محفظتك. قد تكون دون اتصال أو Blockchain هي التي تعاني من صعوبات. الرجاء إغلاق التطبيق ثم حاول مرة أخرى في وقت لاحق أو إعادة زوج لك الجهاز.";

/* No comment provided by engineer. */
"Archive" = "أرشيف العناوين";

/* No comment provided by engineer. */
"Archived" = "الأرشيف";

/* No comment provided by engineer. */
"Automatically" = "تلقائيا";

/* No comment provided by engineer. */
"Before accessing your wallet, please choose a pin number to use to unlock your wallet. It's important you remember this pin as it cannot be reset or changed without first unlocking the app." = "قبل الوصول إلى محفظتك الرجاء اختيار رقم سري لاستخدام لفتح محفظتك. من المهم تذكر هذا الرقم لأنه لا يمكن إعادة تعيين أو تغيير دون فتح التطبيق.";

/* No comment provided by engineer. */
"Cancel" = "إلغاء";

/* No comment provided by engineer. */
"Cannot save PIN Code while wallet is not initialized or password is null" = "لا يمكن حفظ الرقم السري بينما المحفظة لم يتم تهيئة أو كلمة المرور فارغة";

/* No comment provided by engineer. */
"Change PIN" = "تغيير PIN";

/* No comment provided by engineer. */
"Close App" = "إغلاق التطبيق";

/* No comment provided by engineer. */
"Confirm Payment" = "دفع تأكيد";

/* No comment provided by engineer. */
"Confirm payment of %@ (%@) to %@" = "تأكيد الدفع%1$@ (%2$@) إلى %3$@";

/* No comment provided by engineer. */
"Send from..." = "إرسال من...";

/* No comment provided by engineer. */
"Send to..." = "إرسال إلى...";

/* No comment provided by engineer. */
"Decrypted PIN Password length 0" = "فك دبوس طول كلمة السر 0";

/* No comment provided by engineer. */
"Decrypting Private Key" = "فك تشفير المفتاح الخاص";

/* No comment provided by engineer. */
"Enter Password" = "أدخل كلمة المرور";

/* No comment provided by engineer. */
"Error" = "خطأ";

/* No comment provided by engineer. */
"Failed To Load Wallet" = "فشل تحميل المحفظة";

/* No comment provided by engineer. */
"No internet connection." = "أي اتصال بالإنترنت.";

/* No comment provided by engineer. */
"Connection timed out. Please check your internet connection." = "انتهت مهلة الاتصال. الرجاء التحقق من اتصالك بالإنترنت.";

/* No comment provided by engineer. */
"Empty response from server." = "فارغة استجابة من الملقم.";

/* No comment provided by engineer. */
"Invalid server response. Please check your internet connection." = "استجابة الملقم غير صالح. الرجاء التحقق من اتصالك بالإنترنت.";

/* No comment provided by engineer. */
"Forget Wallet" = "نسيت المحفظة";

/* No comment provided by engineer. */
"How would you like to pair?" = "كيف تريد أن الزوج ؟ ";

/* No comment provided by engineer. */
"Imported Private Key %@" = "المستوردة خاصة المفتاح %@";

/* No comment provided by engineer. */
"Information" = "معلومات";

/* No comment provided by engineer. */
"Invalid email address." = "عنوان البريد الإلكتروني غير صالح.";

/* No comment provided by engineer. */
"Invalid GUID" = "صالح GUID";

/* No comment provided by engineer. */
"Invalid Identifier" = "صالح معرف";

/* No comment provided by engineer. */
"Invalid Send Value" = "يرجى إدخال مبلغ";

/* No comment provided by engineer. */
"Invalid Shared Key" = "صالح المشتركة الرئيسية";

/* No comment provided by engineer. */
"Invalid Status Code Returned %@" = "صالح قانون الأحوال عاد %@";

/* No comment provided by engineer. */
"Invalid to bitcoin address" = "عنوان غير صالح بيتكوين";

/* No comment provided by engineer. */
"Loading External Page" = "تحميل الصفحة الخارجية";

/* No comment provided by engineer. */
"Logout" = "تسجيل الخروج";

/* No comment provided by engineer. */
"Do you really want to log out?" = "هل تريد تسجيل الخروج حقاً؟";

/* No comment provided by engineer. */
"Please enter your PIN" = "الرجاء إدخال رقم PIN الخاص بك";

/* No comment provided by engineer. */
"Please enter a new PIN" = "الرجاء إدخال رقم PIN الجديد";

/* No comment provided by engineer. */
"Confirm your PIN" = "تأكيد رقم التعريف الشخصي الخاص بك";

/* No comment provided by engineer. */
"Incorrect PIN. Please retry." = "PIN غير صحيح. الرجاء إعادة المحاولة.";

/* No comment provided by engineer. */
"News, Price & Charts" = "أخبار، السعر آند المخططات";

/* No comment provided by engineer. */
"Manually" = "يدويا";

/* No comment provided by engineer. */
"No" = "لا";

/* No comment provided by engineer. */
"No Label" = "لا تسمية";

/* No comment provided by engineer. */
"No Password Entered" = "لا يوجد كلمة المرور";

/* No comment provided by engineer. */
"OK" = "موافق";

/* No comment provided by engineer. */
"Parsing Pairing Code" = "تحليل الاقتران رمز";

/* No comment provided by engineer. */
"Password must 10 characters or longer" = "يجب أن تكون كلمة المرور 10 أحرف أو أطول";

/* No comment provided by engineer. */
"Passwords do not match" = "كلمات لا تتطابق";

/* No comment provided by engineer. */
"Payment Sent!" = "ارسال المبلغ!";

/* No comment provided by engineer. */
"PIN Encrypted String is nil" = "دبوس مشفرة سلسلة النيل";

/* No comment provided by engineer. */
"PIN Response Object key or value length 0" = "دبوس استجابة الكائن مفتاح أو قيمة طول 0";

/* No comment provided by engineer. */
"PIN Response Object success length 0" = "دبوس استجابة الكائن نجاح طول 0";

/* No comment provided by engineer. */
"PIN Saved Successfully" = "دبوس حفظ بنجاح";

/* No comment provided by engineer. */
"PIN Validation cannot be completed. Please enter your wallet password manually." = "دبوس التحقق من صحة يكتمل. الرجاء إدخال محفظتك كلمة السر يدويا.";

/* No comment provided by engineer. */
"PIN Validation Error" = "دبوس خطأ التحقق من صحة";

/* No comment provided by engineer. */
"Please choose another PIN" = "الرجاء اختيار آخر رقم التعريف الشخصي";

/* No comment provided by engineer. */
"Please enter your 36 character wallet identifier correctly. It can be found in the welcome email on startup." = "من فضلك ادخل 36 حرف المحفظة معرف بشكل صحيح. ويمكن العثور عليها في يقومو على بدء التشغيل.";

/* No comment provided by engineer. */
"Please provide an email address." = "يرجى توفير عنوان بريد إلكتروني.";

/* No comment provided by engineer. */
"Retry Validation" = "أعد محاولة إجراء التحقق من الصحة";

/* No comment provided by engineer. */
"Scan Watch Only Address?" = "مسح مشاهدة الوحيدة العنوان ؟ ";

/* No comment provided by engineer. */
"Second Password Incorrect" = "الثاني كلمة المرور غير صحيحة";

/* No comment provided by engineer. */
"Server Returned Null Status Code" = "خادم عاد فارغة رمز الحالة";

/* No comment provided by engineer. */
"Success" = "النجاح";

/* No comment provided by engineer. */
"The private key you are attempting to import is encrypted. Please enter the password below." = "المفتاح الخاص عند محاولة استيراد مشفرة. يرجى إدخال كلمة المرور أدناه.";

/* No comment provided by engineer. */
"This action requires the second password for your bitcoin wallet. Please enter it below and press continue." = "هذا العمل يتطلب الثانية كلمة السر الخاصة بك bitcoin wallet. الرجاء إدخال الأمر التالي ثم اضغط على متابعة.";

/* No comment provided by engineer. */
"This will erase all wallet data on this device. Please confirm you have your wallet information saved elsewhere otherwise any bitcoins in this wallet will be inaccessible!!" = "هذا سوف يمحو كل محفظة البيانات على هذا الجهاز. من فضلك تأكد من محفظتك المعلومات المحفوظة في أي مكان آخر خلاف ذلك في أي bitcoins في هذه المحفظة من شأنها أن تكون غير قابلة للوصول!!";

/* No comment provided by engineer. */
"Unarchive" = "إلغاء الأرشفة عنوان";

/* No comment provided by engineer. */
"Unconfirmed" = "غير مؤكدة";

/* No comment provided by engineer. */
"Unsupported Private Key Format" = "غير معتمد على المفتاح الخاص تنسيق";

/* No comment provided by engineer. */
"User Declined" = "المستخدم ورفض";

/* No comment provided by engineer. */
"Wallet address %@ has funds available to spend. However the private key needs to be scanned from a paper wallet or QR Code. Would you like to scan the private key now?" = "محفظة عنوان %@ وقد الأموال المتاحة للإنفاق. ولكن المفتاح الخاص يجب أن يتم فحصها من ورقة المحفظة أو رمز QR. هل ترغب في مسح المفتاح الخاص الآن ؟ ";

/* No comment provided by engineer. */
"Wallet Paired Successfully." = "محفظة الاقتران بنجاح.";

/* No comment provided by engineer. */
"Warning!!!" = "تحذير!!!";

/* No comment provided by engineer. */
"Would you like to add the bitcoin address %@ to your address book?" = "هل ترغب في إضافة bitcoin عنوان %@ إلى دفتر العناوين الخاص بك ؟ ";

/* No comment provided by engineer. */
"Yes" = "نعم";

/* No comment provided by engineer. */
"You must enter a destination address" = "يجب عليك إدخال عنوان الوجهة";

/* No comment provided by engineer. */
"You must enter a label" = "يجب إدخال بطاقة";

/* No comment provided by engineer. */
"Your wallet was successfully created." = "محفظتك بنجاح إنشاء.";

/* No comment provided by engineer. */
"Close" = "قم بإغلاق";

/* No comment provided by engineer. */
"Back" = "مرة أخرى";

/* No comment provided by engineer. */
"New Wallet" = "محفظة جديدة";
